//Напишите программу, которая на вход принимает натуральное число N, 
//а на выходе показывает его цифры через запятую.

int n = 8;
int i = 0;

while(i<=n){
    Console.Write(i + ",");
    i++;
}