//Напишите программу, которая принимает на вход число и 
//проверяет, кратно ли оно одновременно 7 и 23.

//161


Console.Write("Введите число: ");
int n = Convert.ToInt32(Console.ReadLine());
if (161 % n == 0)
    Console.WriteLine("yes");
else
    Console.WriteLine("no");